; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v1 - type_2 ?v2 - type_3)
 	      (pred_2 ?v8 - object ?v2 - type_3)
	      (pred_4 ?v1 - type_2 ?v7 - type_1)
	      (pred_1 ?v1 - type_2 ?v8 - object ?v7 - type_1))

   (:action op_2
       :parameters  (?v1 - type_2 ?v4 ?v3 - type_3)
       :precondition (and  (pred_3 ?v1 ?v4))
       :effect (and  (pred_3 ?v1 ?v3)
		     (not (pred_3 ?v1 ?v4))))

   (:action op_1
       :parameters (?v1 - type_2 ?v5 - object ?v6 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_2 ?v5 ?v6) (pred_3 ?v1 ?v6) (pred_4 ?v1 ?v7))
       :effect (and (pred_1 ?v1 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v6)) 
		    (not (pred_4 ?v1 ?v7))))

   (:action op_3
       :parameters (?v1 - type_2 ?v5 - object ?v6 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v5 ?v7) (pred_3 ?v1 ?v6))
       :effect (and (pred_2 ?v5 ?v6)
		    (pred_4 ?v1 ?v7)
		    (not (pred_1 ?v1 ?v5 ?v7)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_08 - type_2
obj_03 obj_09 - type_1
obj_02 obj_04 obj_10 obj_01 - type_3
obj_05 obj_06 obj_07 - object)
(:init
(pred_3 obj_08 obj_02)
(pred_4 obj_08 obj_03)
(pred_4 obj_08 obj_09)
(pred_2 obj_05 obj_01)
(pred_2 obj_06 obj_02)
(pred_2 obj_07 obj_10)
)
(:goal
(and
(pred_2 obj_05 obj_01)
(pred_2 obj_06 obj_10)
(pred_2 obj_07 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_08 ?b obj_09))))
)
)

; plan
1. (op_1 obj_08 obj_06 obj_02 obj_03)
   deleted: (pred_2 obj_06 obj_02) (pred_4 obj_08 obj_03)
   added: (pred_1 obj_08 obj_06 obj_03)
   goals met: 1 of 3
2. (op_2 obj_08 obj_02 obj_10)
   deleted: (pred_3 obj_08 obj_02)
   added: (pred_3 obj_08 obj_10)
   goals met: 1 of 3
3. (op_3 obj_08 obj_06 obj_10 obj_03)
   deleted: (pred_1 obj_08 obj_06 obj_03)
   added: (pred_2 obj_06 obj_10) (pred_4 obj_08 obj_03)
   goals met: 2 of 3
4. (op_1 obj_08 obj_07 obj_10 obj_03)
   deleted: (pred_2 obj_07 obj_10) (pred_4 obj_08 obj_03)
   added: (pred_1 obj_08 obj_07 obj_03)
   goals met: 2 of 3
5. (op_2 obj_08 obj_10 obj_01)
   deleted: (pred_3 obj_08 obj_10)
   added: (pred_3 obj_08 obj_01)
   goals met: 2 of 3
6. (op_3 obj_08 obj_07 obj_01 obj_03)
   deleted: (pred_1 obj_08 obj_07 obj_03)
   added: (pred_2 obj_07 obj_01) (pred_4 obj_08 obj_03)
   goals met: 3 of 3
